{
    "What robotics projects has Aren worked on?": "[github.com/WisconsinRobotics/WRoverSoftware] He contributed to the programming for the Wisconsin Rover project at UW-Madison.",
    "What simulation projects has Aren worked on?": [
        "[arendesai.com/MSO-README.md] Check out his MarketSimOptimizer, a closed-source simulation of the MISO market for generation units.",
        "[github.com/ArenKDesai/Boat] He also created a boat simulation in Blender rendered in Unity."
    ],
    "What is Aren's educational background?": "[arendesai.com/portfolio] His portfolio includes coursework from his studies, available here. He also has a resume and CV available for download.",
    "Where can I find Aren's data science projects?": [
        "[github.com/ArenKDesai/ArenWebsite] His website is hosted on GCP and includes links to his data science work.",
        "[arendesai.com/LMPF-README.md] He worked on a locational market price forecasting project using LEAR and DNN models."
    ],
    "What computer graphics projects has Aren created?": [
        "[github.com/ArenKDesai/Boat] A boat he modeled in Blender and rendered in Unity.",
        "[arendesai.com/bookofjoe] Book of Joe, his first portfolio project for Honors Graphics, a web game.",
        "[arendesai.com/cybercity] CyberCity, a 3D cyberpunk city project."
    ],
    "What programming languages does Aren know?": "[arendesai.com/portfolio] He knows Python, Java, JavaScript, Julia, C, C++, C#, R, SQL, and MatLab.",
    "Where can I find Aren's resume?": "[arendesai.com/resume_nodetails.pdf] His resume is available for download here.",
    "What was Aren's role in Google Developer Student Club?": "[github.com/ArenKDesai/Boat] He served as the Finance Lead from 2023-2024.",
    "How can I contact Aren professionally?": "[arendesai.com/portfolio] His LinkedIn profile is linked on his portfolio page.",
    "What is the hosting setup for this website?": [
        "[github.com/ArenKDesai/ArenWebsite] This website is hosted on Google Cloud Platform (GCP), with the LLM also running and rate-limited on GCP."
    ]
}