{
    "What educational background does Aren have?": ["[arendesai.com/resume_nodetails.pdf] He holds a BS in Computer Science & Data Science from UW-Madison, set to graduate in Spring 2025. **Computer Science** and **Data Science** are his primary fields of study."],
    "What technical skills does Aren possess?": ["[arendesai.com/technical-skills.pdf] He is proficient in Python, SQL, R, Java, C/C++/C#, JavaScript, Julia, MATLAB, OpenGL, WebGL, Unity, Blender, Gazebo, ROS/ROS2, Pandas, NumPy, PyTorch, TensorFlow, Scikit-Learn, Keras."],
    "Can you provide details on Aren's data science projects?": ["[arendesai.com/MSO-README.md] MarketSimOptimizer simulates energy markets. [arendesai.com/LMPF-README.md] LMP Forecasting uses LEAR and DNN models for price prediction. **Data Science** applications include energy market analysis."],
    "What robotics work has Aren been involved in?": ["[github.com/WisconsinRobotics/WRoverSoftware] Developed rover software at UW-Madison using ROS2. **Robotics** projects involve autonomous navigation and control systems."],
    "What graphics projects has Aren created?": ["[github.com/ArenKDesai/Boat] 3D boat model in Blender/Unity. [arendesai.com/bookofjoe] Web-based portfolio game. [arendesai.com/cybercity] 3D cyberpunk city environment. **Computer Graphics** showcase his visual computing skills."],
    "What experience does Aren have in the workforce?": ["[ Madison Gas & Electric ] Energy Supply Intern role. [ Compeer Financial ] Data Analytics internship. **Work Experience** includes data analysis and energy market insights."],
    "How has Aren contributed to leadership roles?": ["[ UW-Madison CS Club ] Leadership in organizing events and projects. Focus on fostering collaboration and innovation within tech communities. **Leadership Contributions** emphasize mentorship and community building."],
    "What are some of Aren's personal interests or hobbies beyond work?": ["Aren enjoys coding challenges, participating in hackathons, and exploring emerging technologies. He also has a keen interest in environmental sustainability and its intersection with technology."],
    "Where can I find information about Aren's coursework?": ["[arendesai.com/courses.pdf] Detailed list of relevant coursework including algorithms, machine learning, and robotics. **Coursework** highlights foundational knowledge in computer science and data analysis."],
    "Is there a way to view Aren's resume in more detail?": ["[arendesai.com/resume_nodetails.pdf] Comprehensive resume detailing education, skills, projects, and experiences. **Resume** available for detailed review of his professional background."],
    "How does Aren approach continuous learning and development?": ["Aren actively engages with online courses, attends tech conferences, and contributes to open-source projects. He emphasizes staying updated with the latest advancements in **Artificial Intelligence** and **Data Science**."],
    "Can you tell me about Aren's involvement with AI projects?": ["[arendesai.com/AI-projects.pdf] Involvement includes research in machine learning algorithms and applications in energy markets. **AI Projects** demonstrate his expertise in predictive modeling and data analysis."],
    "What advice would Aren give to newcomers in computer science?": ["Start with foundational courses, participate in coding challenges, and collaborate on open-source projects. **Learning Path** should focus on both theoretical understanding and practical implementation skills."],
    "How has Aren applied machine learning in his projects?": ["Used in energy market forecasting with LMP Forecasting project and rover software development at UW-Madison. **Machine Learning Applications** showcase predictive analytics in diverse domains."],
    "Where can I find more information on Aren's data science tools and libraries?": ["[arendesai.com/data-science-tools.pdf] Detailed list of tools and libraries including Python, TensorFlow, and Pandas. **Data Science Tools** highlight his technical proficiency in the field."]
}