{
    "What is your background?": "[about-arendesai] His education includes a BS in Computer Science & Data Science from UW-Madison (Spring 2025), with expertise in programming languages like Python, SQL, R, Java, and C++. He has experience in data science, graphics, and robotics projects.",
    "Can you tell me about Aren Desai?": "[about-arendesai] Aren Desai is a UW-Madison student pursuing a BS in Computer Science & Data Science. His skills span programming, data analysis, computer graphics, and robotics, with experience in projects like the Wisconsin Rover software and website development using GCP.",
    "What are your technical skills?": "[about-arendesai] He specializes in Python, SQL, R, Java, C/C++/C#, JavaScript, Julia, MATLAB, and data science tools like Pandas, NumPy, PyTorch, TensorFlow, Scikit-Learn, and Keras.",
    "What projects have you worked on?": "[portfolio] Notable projects include the **MarketSimOptimizer**, a MISO market simulation tool; the **LMP Forecasting** system using LEAR and DNN models; and the **WebsiteLLM**, which uses synthetic data and fine-tuning for language modeling.",
    "Tell me about your education": "[about-arendesai] Aren is currently pursuing a BS in Computer Science & Data Science at UW-Madison, expected to graduate in Spring 2025. He has completed coursework in computer graphics, robotics, and data science.",
    "What programming languages do you know?": "[about-arendesai] He is proficient in Python, SQL, R, Java, C/C++/C#, JavaScript, Julia, MATLAB, and others. **Python** is his primary language for data science and machine learning projects.",
    "What graphics projects have you created?": "[computergraphics] Projects include the **Boat**, a Blender/Unity 3D model; the **Book of Joe**, a web-based portfolio game; and the **CyberCity**, a 3D cyberpunk city environment built with Unity.",
    "What robotics work have you done?": "[robotics] He contributed to the **WRoverSoftware** project at UW-Madison, developing software for a rover using ROS/ROS2. This experience highlights his expertise in robotics and autonomous systems.",
    "Where can I see your resume?": "[portfolio/resume.pdf] A detailed version of Aren's resume is available as a PDF on his portfolio page. It includes education, skills, projects, and work experience.",
    "What data science projects have you worked on?": "[datascience] Projects include the **LMP Forecasting** system for electricity price prediction and the **WebsiteLLM**, which leverages synthetic data and fine-tuning techniques for language models.",
    "Do you have any leadership experience?": "[about-arendesai] Yes, Aren has served as a Finance Lead for the Google Developer Student Club and contributed to the Wisconsin Robotics team as an Arm Developer. These roles demonstrate his leadership skills in technical projects.",
    "What is your experience with machine learning?": "[datascience] He has worked on machine learning projects such as the **LMP Forecasting** system, which uses DNN models for price prediction. His expertise includes frameworks like PyTorch and TensorFlow.",
    "Can you explain your work experience?": "[about-arendesai] Aren has interned at Madison Gas & Electric (Energy Supply Intern) and Compeer Financial (Data Analytics). These roles provided hands-on experience in data analysis, project management, and problem-solving.",
    "What is the **WebsiteLLM** project about?": "[datascience/MSO-README.md] The **WebsiteLLM** project involves synthetic data generation and fine-tuning techniques to improve language models. It highlights his expertise in data science and machine learning.",
    "How do you use graphics technologies?": "[computergraphics] He uses OpenGL, WebGL, Unity, Blender, Gazebo, and ROS/ROS2 for projects like the **CyberCity** 3D environment and **Boat**, showcasing his proficiency in computer graphics and game development.",
    "What tools do you use for data science?": "[datascience] He frequently uses Python libraries (Pandas, NumPy), machine learning frameworks (PyTorch, TensorFlow), and Jupyter Notebooks. His work often involves synthetic data generation and model optimization techniques.",
    "What is your approach to problem-solving?": "[about-arendesai] Aren approaches problems systematically, leveraging his technical skills in programming, data analysis, and robotics. He emphasizes creativity, collaboration, and continuous learning in solving complex challenges.",
    "Can you provide examples of your work?": "[portfolio] Examples of his work include the **MarketSimOptimizer**, **LMP Forecasting**, **Boat**, and **CyberCity** projects. These demonstrate his versatility in programming, data science, and creative design.",
    "How do you stay updated with tech trends?": "[about-arendesai] He stays updated by following industry news, attending technical conferences, and participating in online communities. His proactive approach ensures he remains current with the latest tools and methodologies.",
    "What are your future goals as a developer?": "[about-arendesai] He aims to continue advancing his skills in data science, computer graphics, and robotics. His goal is to contribute to innovative projects that solve real-world problems while staying at the forefront of technological advancements."
}