{
    "What degrees is Aren Desai pursuing?": "[arendesai.com/portfolio] He is currently pursuing a BS in Computer Science and Data Science at the University of Wisconsin-Madison, expected to graduate in Spring 2025.",
    
    "How does the MarketSimOptimizer work?": "[arendesai.com/MSO-README.md] The MarketSimOptimizer simulates electricity markets using MISO data, optimizing market outcomes with advanced algorithms.",
    
    "Which programming languages does Aren know for data science?": "[ithub.com/ArenKDesai] He is proficient in Python, R, SQL, and uses libraries like Pandas, NumPy, PyTorch, TensorFlow, Scikit-Learn, and Keras for data science tasks.",
    
    "Can you tell me about Aren's internship at Madison Gas & Electric?": "[arendesai.com/portfolio#experience] During his internship, he focused on energy supply analysis and data-driven decision-making processes.",
    
    "What advanced data science courses has Aren taken?": "[arendesai.com/coursework] He has completed advanced coursework in statistical learning, databases, algorithms, machine learning, and systems programming.",
    
    "What is Aren's role in Google Developer Student Club?": "[github.com/ArenKDesai] He serves as the Finance Lead, helping organize events and manage resources for student developers in Madison.",
    
    "How can I contact Aren Desai?": "[arendesai.com/contact] You can reach him through his contact form or follow his LinkedIn profile for updates.",
    
    "What is the Wisconsin Rover project about?": "[github.com/WisconsinRobotics/WRoverSoftware] The project involves developing autonomous navigation systems for a rover using ROS2 and C++.",
    
    "Can you explain Aren's role in the Book of Joe project?": "[arendesai.com/bookofjoe] He led the development of this web-based portfolio game, focusing on interactive design and user engagement.",
    
    "What tools does Aren use for computer graphics?": "[github.com/ArenKDesai/Boat] He uses Blender, Unity, OpenGL, and WebGL for 3D modeling and game development."
}