{
    "What is Aren Desai's field of study?": "[link](https://arendesai.com/portfolio) with explanation: Aren Desai is pursuing a dual Bachelor of Science in Computer Science and Data Science at UW-Madison, set to graduate in Spring 2025.",
    "Can you tell me about Aren's work experience?": "[link](https://arendesai.com/resume_nodetails.pdf) with explanation: Aren has interned at Madison Gas & Electric as an Energy Supply Intern and at Compeer Financial as a Data Analytics Specialist, showcasing his expertise in energy management and data-driven decision-making.",
    "What technical skills does Aren possess?": "[link](https://arendesai.com/cv_nodetails.pdf) with explanation: Aren is proficient in Python, SQL, R, Java, C/C++/C#, JavaScript, Julia, MATLAB, and more, demonstrating a strong foundation in programming and data analysis.",
    "Does Aren have experience with machine learning?": "[link](https://arendesai.com/cv_nodetails.pdf) with explanation: Yes, he has used PyTorch and TensorFlow for various projects, showcasing his proficiency in deep learning techniques.",
    "What graphics projects has Aren worked on?": "[link](https://github.com/ArenKDesai/Boat) with explanation: He created a 3D boat model using Blender and Unity, combining photorealistic rendering with interactive simulations.",
    "What is the WRoverSoftware project?": "[link](https://github.com/WisconsinRobotics/WRoverSoftware) with explanation: It’s the software for the Wisconsin Rover, developed by Aren as part of UW-Madison's robotics team, using ROS2 for autonomous navigation and data processing.",
    "How can I contact Aren for more information?": "[link](https://arendesai.com/portfolio) with explanation: His portfolio includes links to his LinkedIn and GitHub profiles, where you can reach out for further inquiries.",
    "What courses has Aren taken in data science?": "[link](https://arendesai.com/cv_nodetails.pdf) with explanation: He has completed courses on data analysis, machine learning, and natural language processing, enhancing his expertise in the field.",
    "Can you explain Aren's role in the Wisconsin Robotics team?": "[link](https://github.com/WisconsinRobotics/WRoverSoftware) with explanation: As an Arm Developer, he contributed to the WRoverSoftware, focusing on systems integration and automation for the rover project.",
    "What is the purpose of the Book of Joe project?": "[link](https://arendesai.com/bookofjoe) with explanation: It’s a web-based portfolio game designed to showcase interactive storytelling and character development in a creative format.",
    "Does Aren have experience with web development?": "[link](https://github.com/ArenKDesai/Boat) with explanation: His boat model project uses web technologies for 3D visualization, indicating his familiarity with web-based applications.",
    "What is the LMP Forecasting project?": "[link](https://arendesai.com/LMPF-README.md) with explanation: It involves using LEAR (Long-term Energy Alternatives and Recommendations) and deep neural networks to forecast electricity prices accurately.",
    "How can I view Aren's resume?": "[link](https://arendesai.com/resume_nodetails.pdf) with explanation: His resume provides a detailed overview of his academic background, work experience, and technical skills.",
    "What is the MarketSimOptimizer project?": "[link](https://arendesai.com/MSO-README.md) with explanation: It’s a tool for simulating market scenarios, helping users understand the impact of various factors on financial markets.",
    "Can you tell me about Aren's role in Google Developer Student Clubs?": "[link](https://github.com/ArenKDesai/CyberCity) with explanation: He served as the Finance Lead, organizing workshops and events to foster innovation among student developers.",
    "What is the CyberCity project?": "[link](https://github.com/ArenKDesai/CyberCity) with explanation: It’s a virtual city simulation project where Aren worked on urban planning and visualization using 3D modeling tools.",
    "Does Aren have any publications or research work?": "[link](https://arendesai.com/cv_nodetails.pdf) with explanation: His CV highlights his research on energy systems and machine learning applications, indicating active involvement in academic and professional domains.",
    "What is the purpose of the LMP Forecasting project?": "[link](https://arendesai.com/LMPF-README.md) with explanation: It aims to provide accurate electricity price forecasts using advanced modeling techniques, aiding decision-makers in energy management.",
    "How can I contact Aren for collaboration opportunities?": "[link](https://github.com/ArenKDesai/CyberCity) with explanation: His GitHub profile provides contact information and examples of his work, making it easy to reach out for potential collaborations.",
    "What is the goal of the MarketSimOptimizer tool?": "[link](https://arendesai.com/MSO-README.md) with explanation: It aims to optimize market simulations, enabling users to test scenarios and make informed business decisions efficiently.",
    "Can you explain Aren's work on the CyberCity project?": "[link](https://github.com/ArenKDesai/CyberCity) with explanation: He focused on creating a realistic virtual city environment, integrating 3D rendering and urban planning to enhance visual representation of urban growth."
}