{
    "What is your educational background?": ["[arendesai.com/portfolio] He is pursuing a BS in Computer Science & Data Science at the University of Wisconsin-Madison, expected to graduate in Spring 2025. His academic journey focuses on **data science** and **computer science** foundations."],
    "What programming languages does he know?": ["[arendesai.com/portfolio] He is proficient in Python, SQL, R, Java, C/C++/C#, JavaScript, Julia, and MATLAB. These skills are essential for his work in **data science**, **robotics**, and **computer graphics**."],
    "Can you tell me about your data science projects?": ["[arendesai.com/datascience] He has worked on the MarketSimOptimizer (MSO) for market simulation and LMP Forecasting using LEAR and DNN models. These projects highlight his expertise in **data analysis** and **machine learning**."],
    "What graphics-related work has he done?": ["[arendesai.com/computergraphics] He created a 3D boat model using Blender/Unity, developed the Book of Joe web-based game, and designed a cyberpunk city environment. These projects showcase his skills in **3D modeling** and **game development**."],
    "Tell me about his robotics experience?": ["[arendesai.com/robotics] He contributed to the Wisconsin Rover Software project at the University of Wisconsin-Madison, focusing on rover autonomy using ROS2. This work highlights his involvement in **autonomous systems** and **robotics research**."],
    "How can I view his resume or CV?": ["[arendesai.com/portfolio/resume.pdf] His resume is available for a detailed overview of his professional experience, while the CV provides a comprehensive list of his academic and technical achievements."],
    "What leadership roles has he held?": ["[arendesai.com/portfolio] He serves as the Finance Lead for the Google Developer Student Club and works on the Wisconsin Robotics team. These roles demonstrate his **leadership** and **collaborative skills**."],
    "What coursework has he completed?": ["[arendesai.com/coursework] He has taken courses in data science, computer graphics, robotics, and machine learning at UW-Madison. These include topics like algorithms, systems programming, and statistical modeling."],
    "Can you explain his work with Madison Gas & Electric?": ["[arendesai.com/portfolio] During his internship, he focused on energy supply analysis, gaining practical experience in **data analytics** and **energy markets**."],
    "What about his time at Compeer Financial?": ["[arendesai.com/portfolio] At Compeer Financial, he worked on data analytics projects, enhancing his skills in **business intelligence** and **financial analysis**."],
    "How did he create the AI Assistant?": ["[arendesai.com/datascience] The AI Assistant was developed using Python and machine learning techniques, showcasing his ability to apply **artificial intelligence** concepts to real-world problems."],
    "What is MarketSimOptimizer used for?": ["[arendesai.com/datascience] It simulates market scenarios to optimize energy trading strategies, demonstrating his expertise in **market modeling** and **optimization algorithms**."],
    "How did he get involved with Wisconsin Robotics?": ["[arendesai.com/robotics] He joined the team to work on rover autonomy projects, leveraging his skills in **ROS2** and **autonomous systems development**."],
    "What inspired him to study data science?": ["[arendesai.com/portfolio] His interest in solving complex problems using data-driven approaches led him to pursue data science, combining his passion for **mathematics**, **statistics**, and **technology**."],
    "What are his future goals?": ["[arendesai.com/portfolio] He aims to continue advancing in **machine learning**, **robotics**, and **data analytics**, with a focus on innovative and impactful projects."]
}