{
    "What are Aren's technical skills?": "[arendesai.com/portfolio] with detailed overview of his technical proficiencies including Python, SQL, R, Java, C/C++/C#, JavaScript, Julia, MATLAB, and more.",
    "Can you tell me about Aren's education?": "[arendesai.com/portfolio] to learn more about his academic journey at UW-Madison, pursuing a BS in Computer Science & Data Science with expected graduation in Spring 2025.",
    "What data science projects has Aren worked on?": "[arendesai.com/datascience] for information on his MarketSimOptimizer (MISO) and LMP Forecasting projects utilizing LEAR & DNN models.",
    "Does Aren have experience with machine learning?": "[arendesai.com/datascience] to explore his expertise in ML, including work on price prediction models using PyTorch & TensorFlow.",
    "What programming languages does Aren know?": "[arendesai.com/portfolio] for a list of languages like Python, SQL, R, Java, C/C++/C#, JavaScript, Julia, MATLAB.",
    "Tell me about Aren's work experience": "[arendesai.com/portfolio] to read about his roles at Madison Gas & Electric and Compeer Financial, focusing on energy supply and data analytics.",
    "What is the WRoverSoftware project?": "[github.com/ArenKDesai/WRoverSoftware] for details on his work with Wisconsin Robotics on ROS2-based rover software.",
    "What graphics projects has Aren created?": "[arendesai.com/computergraphics] to view his Boat (Blender/Unity) and CyberCity 3D environment projects.",
    "What courses has Aren taken in data science?": "[arendesai.com/coursework] for a breakdown of his coursework at UW-Madison, including foundational data science topics.",
    "How can I see Aren's resume?": "[arendesai.com/portfolio] to access his resume.pdf and cv.pdf files detailing his professional journey.",
    "What about Aren's leadership roles?": "[arendesai.com/portfolio] for info on his role as Finance Lead in Google Developer Student Club and Arm Developer at Wisconsin Robotics.",
    "Can I find out more about his projects?": "[arendesai.com/datascience/computergraphics/robotics] to explore his diverse project portfolio across data science, graphics, and robotics.",
    "Does Aren have any GitHub repositories?": "[github.com/ArenKDesai] for direct links to his repositories like Boat and GCP Website.",
    "What are some of his career goals?": "[arendesai.com/portfolio] to understand his focus on advancing in data science and software development fields.",
    "How does he approach problem-solving?": "[arendesai.com/datascience] for insights into his methodical approach, combining analytical skills with programming expertise.",
    "What is the Book of Joe project?": "[arendesai.com/computergraphics] to learn about his web-based portfolio game built using Unity and Blender.",
    "How does he stay updated in tech?": "[arendesai.com/datascience] for details on his use of industry blogs, forums, and workshops to keep abreast of technological advancements."
}