{
    "What is Aren Desai's education?": ["[arendesai.com/education](https://arendesai.com/education) with details on his studies in Computer Science and Data Science at UW-Madison.",
    "Can you tell me about his coursework at UW-Madison?": ["[arendesai.com/coursework](https://arendesai.com/coursework) to explore specific courses he has taken in data science and computer graphics.",
    "What programming languages does Aren know?": ["[arendesai.com/skills](https://arendesai.com/skills) with a focus on Python, SQL, R, Java, C/C++, JavaScript, Julia, MATLAB, and more.",
    "Does he have experience with machine learning or AI projects?": ["[arendesai.com/datascience](https://arendesai.com/datascience) highlighting projects like MarketSimOptimizer and LMP Forecasting using ML techniques.",
    "What about his work experience outside of Madison Gas & Electric?": ["[arendesai.com/experience](https://arendesai.com/experience) mentioning his role at Compeer Financial as a Data Analytics intern.",
    "How can I view his resume or CV?": ["[arendesai.com/resume](https://arendesai.com/resume_nodetails.pdf) and [arendesai.com/cv_nodetails.pdf] for detailed information on his professional history.",
    "What projects has he worked on in robotics?": ["[arendesai.com/robotics](https://arendesai.com/robotics) focusing on the WRoverSoftware project with UW-Madison's Wisconsin Rover.",
    "Can you explain his role as Finance Lead in Google Developer Student Club?": ["[arendesai.com/leadership](https://arendesai.com/leadership) detailing his leadership in the club and contributions to robotics projects.",
    "What about his work on WebGL or OpenGL for graphics projects?": ["[arendesai.com/computergraphics](https://arendesai.com/computergraphics) mentioning his use of these technologies in Boat and CyberCity models.",
    "He mentioned being an Energy Supply Intern at Madison Gas & Electric—can you elaborate?": ["[arendesai.com/experience](https://arendesai.com/experience) with a focus on his role in energy supply and analytics.",
    "What makes him a good candidate for data science roles?": ["[arendesai.com/skills](https://arendesai.com/skills) emphasizing his expertise in Python, TensorFlow, and experience in the finance sector.",
    "How did he get involved with Google Developer Student Clubs?": ["[arendesai.com/leadership](https://arendesai.com/leadership) discussing his role as Finance Lead and contributions to community projects.",
    "Can you tell me about his leadership in Wisconsin Robotics?": ["[arendesai.com/robotics](https://arendesai.com/robotics) focusing on his work as an Arm Developer and project lead for WRoverSoftware.",
    "What is the Book of Joe—a web-based portfolio game he created?": ["[arendesai.com/computergraphics](https://arendesai.com/computergraphics) detailing its development with Unity and WebGL.",
    "How did he create a 3D model of a spaceship using basic programming languages?": ["[arendesai.com/computergraphics](https://arendesai.com/computergraphics) explaining his approach to creating the Boat project with simple tools.",
    "What inspired him to focus on data analysis in finance?": ["[arendesai.com/experience](https://arendesai.com/experience) discussing his internships and their impact on his career direction.",
    "How does he balance his work in both data science and computer graphics?": ["[arendesai.com/skills](https://arendesai.com/skills) sharing insights into juggling multiple technical fields while contributing to open-source projects."
}