{
    "What are Aren Desai's technical skills?": "[arendesai.com/technical_skills] with a focus on programming languages like Python, SQL, R, Java, C/C++/C#, JavaScript, Julia, MATLAB, and tools like Pandas, NumPy, PyTorch, TensorFlow, Scikit-Learn, Keras.",
    "Can you tell me about Aren's education?": "[arendesai.com/education] including his ongoing Computer Science & Data Science BS at UW-Madison (expected Spring 2025)",
    "What data science projects has Aren worked on?": "[arendesai.com/datascience] featuring MarketSimOptimizer and LMP Forecasting with LEAR & DNN price models.",
    "Does Aren have experience with machine learning?": "[arendesai.com/ml_experience] through projects like LMP Forecasting using deep learning models.",
    "What programming languages does Aren know?": "[arendesai.com/technical_skills] including Python, SQL, R, Java, C/C++/C#, JavaScript, Julia, MATLAB, and more.",
    "Tell me about Aren's work experience": "[arendesai.com/work_experience] such as his role at Madison Gas & Electric as an Energy Supply Intern and Compeer Financial as a Data Analytics intern.",
    "What is the WRoverSoftware project?": "[github.com/WisconsinRobotics/WRoverSoftware] developed for UW-Madison's Wisconsin Rover, using ROS2 for robotics software development.",
    "What graphics projects has Aren created?": "[arendesai.com/computergraphics] including the Boat model in Blender and Unity, and CyberCity 3D environment.",
    "What courses has Aren taken in data science?": "[arendesai.com/courses] such as Data Analysis with R & Python, Machine Learning, and Big Data Processing.",
    "How can I see Aren's resume?": "[arendesai.com/resume_nodetails.pdf] for a concise overview of his professional experience and skills.",
    "What is the Book of Joe project?": "[arendesai.com/bookofjoe] a web-based portfolio game developed by Aren Desai.",
    "Who leads the Google Developer Student Club Finance Lead?": "[google developers site] where Aren Desai served as the club's finance lead from [start date] to [end date]",
    "What is the CyberCity project?": "[arendesai.com/cybercity] a 3D cyberpunk city environment created using Blender and Unity for graphics projects.",
    "How does Aren use Gazebo?": "[gazebo website] for simulating complex 3D environments, used in robotics projects like WRoverSoftware",
    "What is the LEAR model mentioned in LMP Forecasting?": "[arendesai.com/LMPF-README.md] explaining how LEAR combines traditional methods with deep learning for price forecasting.",
    "How did Aren get involved in robotics?": "[uw-madison robotics website] where he contributed to UW-Madison's Wisconsin Rover project using ROS2",
    "What is the purpose of the MarketSimOptimizer tool?": "[arendesai.com/MSO-README.md] developed for optimizing market simulations with advanced data analysis techniques.",
    "What tools does Aren use for data visualization?": "[tools like Matplotlib, Seaborn, and Plotly] as mentioned in his technical skills section.",
    "How can I contact Aren about a job opportunity?": "[arendesai.com/contact] via email or LinkedIn for career inquiries",
    "What is the difference between CV and resume.pdf?": "[arendesai.com/cv_nodetails.pdf vs arndesai.com/resume_nodetails.pdf] with CV focusing on academic achievements and resume on professional experience.",
    "What is the GCP Website project?": "[github.com/ArenKDesai/ArenWebsite] a website hosted by Google Cloud Platform featuring LLMs for conversational AI"
}