{
    "What is Aren Desai's educational background?": ["[arendesai.com/portfolio] He holds a BS in Computer Science & Data Science from UW-Madison (Spring 2025). His coursework includes data science, computer graphics, and robotics.", "**Data Science** courses suggest follow-up on specific topics like machine learning or AI."],
    "What programming languages does Aren know?": ["[github.com/ArenKDesai] He is proficient in Python, SQL, R, Java, C/C++/C#, JavaScript, Julia, and MATLAB.", "**Python** and **R** are particularly strong for data science applications."],
    "Can you tell me about his data science projects?": ["[arendesai.com/datascience]", "[github.com/ArenKDesai/ArenWebsite] His work includes market simulation optimization and LMP forecasting models."],
    "Where has Aren interned?": ["[linkedin.com/in/aren-desai] Madison Gas & Electric (Energy Supply Intern) and Compeer Financial (Data Analytics).", "**Energy** and **finance** sectors show diverse experience."],
    "Does he have experience with machine learning?": ["Yes, he has worked on projects like LMP Forecasting using LEAR and DNN models ([arendesai.com/LMPF-README.md]).", "**ML Models** suggest follow-up on specific algorithms or applications."],
    "What 3D graphics projects has Aren created?": ["[github.com/ArenKDesai/Boat] Blender/Unity boat model, [arendesai.com/bookofjoe] web-based game, and [arendesai.com/cybercity] cyberpunk city environment."],
    "Can you provide details on the WRoverSoftware project?": ["[github.com/WisconsinRobotics/WRoverSoftware] UW-Madison rover software developed for robotics research.", "**ROS/ROS2** suggests interest in robotic systems and autonomy."],
    "What courses has Aren taken in data science?": ["UW-Madison coursework includes data science fundamentals, machine learning, and statistics ([arendesai.com/coursework]).", "**Data Science Coursework** can lead to follow-up on specific subjects like AI or optimization."],
    "How can I view Aren's resume or CV?": ["[linkedin.com/in/aren-desai] Detailed LinkedIn profile with education, experience, and skills.", "**LinkedIn Profile** offers comprehensive professional information."],
    "What tools does Aren use for data science?": ["Python libraries like NumPy, Pandas, and TensorFlow ([github.com/ArenKDesai]).", "**Data Science Tools** can be explored further for specific applications or techniques."],
    "Can you tell me about his AI assistant project?": ["[github.com/ArenKDesai/AI-Project] Open-source AI assistant with natural language processing capabilities.", "**AI Projects** suggest follow-up on specific features or technologies used."],
    "Does Aren have experience with open-source contributions?": ["Yes, he has contributed to [github.com/ArenKDesai] and [github.com/WisconsinRobotics].", "**Open Source Contributions** indicate collaboration skills in software development."],
    "What graphics tools is Aren familiar with?": ["Blender, Unity, and other 3D modeling and game engines ([github.com/ArenKDesai/Boat]).", "**Graphics Tools** can lead to discussions on rendering or animation techniques."],
    "How proficient is Aren in Python?": ["He is highly skilled in Python for data science and software development ([github.com/ArenKDesai]).", "**Python Proficiency** suggests follow-up on specific libraries or applications."],
    "Can you tell me about his teamwork experience?": ["Collaborated on UW-Madison robotics projects and open-source contributions ([github.com/WisconsinRobotics]).", "**Team Collaboration** indicates ability to work in group settings for complex projects."]
}