{
    "What is Aren Desai's background?": "[/portfolio] with answer and explanation about his education in Computer Science & Data Science BS at UW-Madison and technical skills including Python, SQL, R, Java, etc.",
    "What degrees is Aren pursuing?": "[/resume.pdf] a detailed resume highlighting his academic journey and skills",
    "Which programming languages does Aren know?": "[/portfolio] with a list of languages he's proficient in",
    "Can you tell me about Aren's data science projects?": "[/datascience/MSO-README.md], [/datascience/LMPF-README.md] for MarketSimOptimizer and LMP Forecasting projects respectively",
    "What computer graphics projects has Aren worked on?": "[/portfolio] mentioning the Boat and Book of Joe projects with links to their respective pages",
    "How is Aren involved in robotics?": "[/datascience#robotics] details his involvement through WRoverSoftware project on GitHub",
    "What coursework has Aren completed?": "[/coursework] provides access to his academic records and subjects studied",
    "Where did Aren intern?": "He interned at [Madison Gas & Electric](https://www.mge.com) and [Compeer Financial](https://www.compeergc.com)",
    "Tell me about the WRoverSoftware project.": "[/datascience#projects] detailed information on his GitHub repository",
    "Does Aren have experience with machine learning?": "Yes, he has worked with TensorFlow and PyTorch as mentioned in his [project READMEs](/datascience/README.md)",
    "What are some of Aren's favorite programming languages?": "Python and Java; explore more about **programming** on his blog",
    "How can I view Aren's resume?": "[/resume.pdf] for a detailed look at his education and work experience",
    "Where can I find Aren's LinkedIn profile?": "[LinkedIn Profile](https://www.linkedin.com/in/arendesai)",
    "Which data science tools does Aren use?": "Pandas, NumPy, Matplotlib; check out his [project READMEs](/datascience/) for specifics",
    "What graphics software is Aren familiar with?": "OpenGL, WebGL, Unity Engine; explore more **graphics projects** on his site",
    "Can you tell me about Aren's internship at Madison Gas & Electric?": "He focused on data analysis and process optimization as mentioned in his [resume](/resume.pdf)",
    "Has Aren worked with Google Cloud Platform (GCP)?": "Yes, he developed a website using GCP; details available in the [project README](/datascience/README.md)",
    "What is the CyberCity project about?": "[/portfolio] describes it as a 3D cyberpunk city project on his site",
    "Tell me about the Book of Joe game.": "[/portfolio] explains it's an interactive web-based portfolio game he created",
    "What skills did Aren gain at Compeer Financial?": "Data analysis and financial systems; detailed in his [work experience](/resume.pdf)"
}